Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: གཞན་དུ་ན་སེམས་ཅན་ལ་ཕན་གདགས་པ་དང་། སེམས་ཅན་ལ་སྙིང་རྗེ་བ་དང་། སེམས་ཅན་དེ་ལ་སྙིང་བརྩེ་བ་དང་། སེམས་ཅན་དེ་དག་ཉིད་བསྡུ་བའི་ཕྱིར་བྱ་བར་ཟད་དོ། །
en: Beyond this, I will do nothing but help beings, be compassionate and loving to them, and work to bring them together.

source: བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་ཅི་ནས་སེམས་ཅན་འདི་དག་ཆོས་ཀུན་རྟོགས་པར་གྱུར་ཅིག་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །
en: May I reach awakening, and then do everything so that these beings realize all dharmas.’

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་གང་སུ་དག་དེ་ལྟར་སེམས་སྐྱེད་པར་བྱེད་པ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱའོ། །
en: Son of noble family, any bodhisattva who arouses such an attitude is truly a bodhisattva.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལུས་དང་སྲོག་ལ་ཡང་མི་ལྟ་བ་ཡིན་ཏེ།
en: “In addition, son of noble family, bodhisattvas have no concern for life or limb.

source: དེ་ནི་སྲོག་གི་ཕྱིར་ཡང་སྡིག་པའི་ལས་མངོན་པར་འདུ་མི་བྱེད་དོ། །
en: Even at the cost of their lives, they will not become involved with any negative actions.

source: ལུས་རྟས་པར་བྱ་བའི་ཕྱིར་ཡ་ང་བའི་འཚོ་བས་འཚོ་བར་མི་བྱེད་དོ། །
en: They will not sustain themselves through any sort of wicked sustenance in order to nourish their physical bodies.

source: དེ་ནི་སྲོག་གི་ཕྱིར་ཡང་གཞན་ལ་སློང་ཁྲོ་མི་བྱེད་དོ། །
en: They will not become angry with anyone, even at the cost of their lives.

source: ལོངས་སྤྱོད་ཀྱི་ཕྱིར་མི་དགེ་བ་མངོན་པར་འདུ་མི་བྱེད་དོ། །
en: They will not become involved in anything unwholesome for the sake of valuables.

source: གཡོག་འཁོར་གྱི་ཕྱིར་ཡང་རྩོད་པ་དང་འཐབ་མོ་སློང་བར་མི་བྱེད་དོ། །
en: They will not instigate fights and quarrels for the sake of attendants and retinue.

source: ཆུང་མ་དང་། བུ་དང་། བུ་མོ་རྣམས་ཀྱི་ཕྱིར་ཡང་གཞན་དག་ལ་འདྲིད་པར་མི་བྱེད་དོ། །
en: They will not deceive others for the sake of their wives, sons, or daughters.

source: གཞན་གྱི་ལོངས་སྤྱོད་དག་ལ་ཡང་བརྣབ་སེམས་སྐྱེད་པར་མི་བྱེད། སེར་སྣའི་སེམས་སྐྱེད་པར་མི་བྱེད་དོ། །
en: They will not develop a covetous or greedy attitude toward others’ valuables.

source: དེ་འདོད་པ་ཉུང་སྟེ་སེམས་སྐྱེད་པ་གཅིག་ཀྱང་དགེ་བ་དང་མི་ལྡན་པ་སྐྱེད་པར་མི་བྱེད་ན་མང་པོ་ལྟ་ཅི་སྨོས།
en: Since they have few desires, they do not give rise to even one moment of an unwholesome mind-state, let alone many moments.

source: དེ་དེ་ལྟར་བརྩོན་ན་འདོད་ཆེན་དང་ཆགས་པ་སྤོང་བར་འགྱུར་རོ། །
en: “Endeavoring in this way, they leave behind intense desire and attachment.

source: འདོད་ཆེན་དང་ཆགས་པ་སྤངས་ན་བཙལ་བར་བྱ་བ་ཚོལ་བར་མི་བྱེད་དོ། །
en: Leaving behind intense desire and attachment, they stop pursuing ambitions.

source: བཙལ་བར་བྱ་བ་མི་ཚོལ་ན་ཡང་དག་པ་ལ་བརྩོན་པར་འགྱུར་རོ། །
en: When they do not pursue ambitions, they strive in what is genuine.

source: ཡང་དག་པ་ལ་བརྩོན་ན་ཡང་དག་པར་འགྲོ་བ་ཐོབ་པར་འགྱུར་རོ། །
en: Striving in what is genuine, they attain genuine progress.

source: ཡང་དག་པར་སོང་ན་ཡང་དག་པའི་བསྒྲུབ་པ་ལ་གནས་པར་འགྱུར་རོ། །
en: Once they make genuine progress, they will remain in genuine practice.

source: ཡང་དག་པ་ལ་ཞུགས་ན། ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་མཉེས་པར་བྱེད་དོ། །ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་མཉེས་པར་བྱས་ནས་སྟེན་པར་བྱེད། འགྲོགས་པར་བྱེད། བསྙེན་བཀུར་བྱེད་དོ། །
en: When they abide in the genuine, they will please the genuine spiritual guides, so that they can follow, keep company with, and serve them.

source: དེ་དགེ་བའི་བཤེས་གཉེན་རྣམས་དང་བསྟེན་ཅིང་འགྲོགས་ལ་བསྙེན་བཀུར་བྱེད་ན་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལས་ཡང་དག་པར་ངེས་པའི་ཆོས་རྣམས་ཐོས་པར་འགྱུར་རོ། །
en: Following, keeping company with, and serving the spiritual guides in this way, they learn from them the teachings of genuine certainty.

source: ཐོས་ནས་ཀྱང་སྒྲུབ་པར་བྱེད་དོ། །
en: Learning these teachings, moreover, they will put them into practice.

source: དེ་ཡང་དག་པའི་ཆོས་ལ་ཞུགས་ནས་ལོག་པར་སྒྲུབ་པ་ལ་གནས་པའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་ཐམས་ཅད་བྱེད་དོ། །
en: Then, having entered into the genuine Dharma, they can help all beings who are immersed in mistaken practices.

source: དེ་སེམས་ཅན་གྱི་དོན་ལ་བརྩོན་ན་མི་རིགས་པར་ལྟུང་བར་མི་འགྱུར་རོ། །
en: Endeavoring to help beings, they will no longer fall into mistakenness.

source: དེ་རིགས་པ་ལ་ཞུགས་ན་འདི་ལྟ་སྟེ། སེམས་ཅན་རྣམས་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པའི་ཚུལ་དང་ཚུལ་མ་ཡིན་པ་ལ་མཁས་པ་འཐོབ་པར་འགྱུར་ཏེ།
en: Once they are immersed in what is right, they will become expert in beings’ various superior and inferior capacities, and correct and incorrect ways of understanding.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་སྦྱིན་པའི་ཚོགས་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡོན་ཏན་གྱི་ཁྱད་པར་དེ་ལྟ་བུ་དག་ཐོབ་པར་འགྱུར་རོ། །
en: Son of noble family, in this way, bodhisattvas who engage in the accumulation of generosity will attain extraordinary qualities of this kind.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་ནང་དང་ཕྱི་རོལ་གྱི་ཆོས་རྣམས་ལ་གཅིག་གིས་འདུ་ཤེས་བསྐྱེད་པར་བྱའི་གཉིས་ཀྱི་འདུ་ཤེས་བསྐྱེད་པར་མི་བྱ་སྟེ
en: “Furthermore, son of noble family, bodhisattva great beings should perceive inner and outer phenomena as one, and not perceive them dualistically.

source: ནང་གི་སའི་ཁམས་གང་ཡིན་པ་དང་། ཕྱི་རོལ་གྱི་སའི་ཁམས་གང་ཡིན་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །
en: There is no duality between what constitutes the element of earth internally and what constitutes the earth element externally; it should not be dualized.

source: ལུས་འདི་ནི་རྩྭ་དང་ཤིང་དང་། རྩིག་པ་དང་། ལམ་སྣང་བ་དང་འདྲ་སྟེ། སྤྱོད་པ་མེད་པ། བྱེད་པ་མེད་པ། སེམས་པ་མེད་པ། སྙིང་པོ་མེད་པ་ཁམས་ཀྱིས་བསྡུས་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: This body is like grass, a tree, a wall, or the scenery along a road: it is inactive, actionless, inanimate, insubstantial, and composed of elements.

source: གལ་ཏེ་འདི་ལ་ལ་ལ་ཞིག་གིས་བཅད་དམ། གཏུབས་སམ། དབྱུག་པའམ། མཚོན་ཆ་འམ། ཤིང་ངམ། བོང་བས་བསྣུན་ཀྱང་རུང་སྟེ། དེ་ལ་བདག་གིས་ཚོར་བའི་རྣམ་པར་རིག་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: If someone were to cut it, chop it, or strike it with a cudgel, sword, stick, or lump of dirt, one should not give rise to the idea, ‘I am experiencing this.’

source: ལུས་ལ་བལྟ་བར་མི་བྱའོ། །
en: One should not be concerned about one’s body,

source: སྲོག་ལ་ཆགས་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: nor attached to one’s life.

source: སེམས་ཅན་དེ་དག་ལ་ཡང་ཐ་བ་དང་སྡང་བའི་སེམས་བསྐྱེད་པར་མི་བྱའོ་སྙམ་པའི་སྟེང་དུ་དེས་སེམས་ཅན་དེ་དག་ལ་བྱམས་པའི་སེམས་བསྐྱེད་པར་བྱའོ། །
en: Moreover, not only should one keep the resolve not to have harsh or angry feelings toward such beings, one should have an attitude of loving kindness for them as well.

source: རིགས་ཀྱི་བུ་དཔེར་ན་སྨན་གྱི་ཤིང་ལྗོན་པ་ནི་རྩ་བ་ལས་ཁྱེར་རམ། སྡོང་པོའམ། ཡལ་གའམ། ཤུན་ལྤགས་སམ། ལོ་མའམ། མེ་ཏོག་གམ། འབྲས་བུའམ། སྙིང་པོ་ལས་ཁྱེར་ན
en: “Son of noble family, take the analogy of a medicinal tree. Say a part of its roots are taken, or its trunk, or branches, or bark, or leaves, or flowers, or fruits, or core.

source: འདི་སྙམ་དུ་བདག་གི་རྩ་བ་ཁྱེར་ལ་སྡོང་པོ་མ་ཁྱེར་ཅིག་ཅེའམ།
en: It does not have such thoughts as, ‘You can take from my roots but not my trunk,’ or ‘

source: བདག་གི་སྡོང་པོ་ཁྱེར་ལ་རྩ་བ་མ་ཁྱེར་ཅིག་ཅེའམ།
en: You can take from my trunk but not my roots,’ or

source: བདག་གི་ཡལ་ག་ཁྱེར་ལ་ལོ་མ་མ་ཁྱེར་ཅིག་ཅེའམ།
en: ‘You can take from my branches but not my leaves,’ or

source: བདག་གི་ལོ་མ་ཁྱེར་ལ་ཡལ་ག་མ་ཁྱེར་ཅིག་ཅེའམ།
en: ‘You can take from my leaves but not my branches.’

source: དེ་བཞིན་དུ་བདག་གི་ཡལ་ག་ཕྲེའུ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། ཤུན་ལྤགས་དང་། སྙིང་པོ་ལས་ཁྱེར་ལ་སྙིང་པོ་མེད་པ་ལས་མ་ཁྱེར་ཅིག་ཅེའམ།
en: Nor does it think, ‘You can take from my twigs, flowers, fruits, bark, and core, but not from what is not my core,’ or

source: བདག་གི་སྙིང་པོ་མེད་པ་ལས་ཁྱེར་ལ་སྙིང་པོ་ལས་མ་ཁྱེར་ཅིག་སྙམ་དུ་རྟོག་པར་མི་བྱེད་དེ
en: ‘You can take from what is not my core, but not from my core.’

source: དེ་ལྟར་ན་སྨན་གྱི་ཤིང་ལྗོན་པ་ནི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་རྣམ་པར་རྟོག་པར་མི་བྱེད་མོད་ཀྱི།
en: Indeed the medicinal tree forms no such thoughts whatsoever.

source: འོན་ཀྱང་སྨན་གྱི་ཤིང་ལྗོན་པ་ནི་རྣམ་པར་མི་རྟོག་བཞིན་དུ་ནད་རབ་དང་། འབྲིང་དང་། ཐ་མ་སེལ་བར་བྱེད་པ་
en: “Nonetheless, while being free of concepts, the medicinal tree heals people from grave, medium, or lesser maladies.

source: དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འབྱུང་བ་ཆེན་པོ་བཞིའི་ལུས་འདི་ལ་སྨན་གྱི་ཤིང་ལྗོན་པ་ལྟ་བུའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: In the same way, son of noble family, bodhisattva great beings should see their bodies, made of the four major elements, as being like medicinal trees:

source: སེམས་ཅན་གང་དང་གང་དག་ལ་ཅི་དང་ཅི་དགོས་པ་དེ་དང་དེ་དེ་བཞིན་དུ་ཁྱེར་ཅིག་ཅེས་བྱས་ཏེ།
en: whatever any being needs, they should let them take it.

source: ལག་པ་འདོད་པ་ལ་ནི་ལག་པ། རྐང་པ་འདོད་པ་ལ་ནི་རྐང་པ། མིག་འདོད་པ་ལ་ནི་མིག །ཤ་འདོད་པ་ལ་ནི་ཤ།།ཁྲག་འདོད་པ་ལ་ནི་ཁྲག །རུས་པ་འདོད་པ་ལ་ནི་རུས་པ། རྐང་འདོད་པ་ལ་ནི་རྐང་། མགོ་བོ་འདོད་པ་ལ་ནི་མགོ་བོ། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་འདོད་པ་ལ་ནི་བདག་གི་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཁྱེར་ཅིག་སྙམ་སྟེ
en: They let those in need of arms take their arms, those in need of legs take their legs, those in need of eyes take their eyes, those in need of meat take their flesh, those in need of blood take their blood, those in need of bones take their bones, those in need of marrow take their marrow, those in need of a head take their head, or those in need of all their limbs and organs take them all.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་སེམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཚོགས་ཀྱིས་བསོད་ནམས་མི་ཟད་པས་མངོན་པར་འབྱུང་བ་ཡིན་ཏེ།
en: “Son of noble family, bodhisattva great beings who think in this way, with such an accumulation of generosity, emerge definitively through their inexhaustible merit.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སྦྱིན་པ་བྱིན་པ་ན་སེམས་ཅན་སེར་སྣ་ཅན་རྣམས་ཀྱི་གཏོང་བ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: When these bodhisattva great beings give something, they dedicate the act entirely so that miserly beings may develop consummate generosity.

source: སེམས་ཅན་དབུལ་པོ་རྣམས་ཀྱིས་ལོངས་སྤྱོད་ཆེན་པོ་འཐོབ་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: They dedicate it entirely so that destitute beings may achieve great prosperity.

source: དེས་ཡན་ལག་དང་ཉིང་ལག་རྣམས་ཡོངས་སུ་གཏོང་བ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: When they give away all their limbs and organs, they dedicate the merit so that all beings might possess all their limbs and organs intact.

source: དེས་སྦྱིན་པ་སྦྱིན་པ་ན་དུས་ཐམས་ཅད་དུ་ཆོས་གསུམ་དུ་ཡོངས་སུ་བསྔོ་བར་མི་བྱ་སྟེ།
en: “There are, nonetheless, three things to which they will never dedicate an act of generosity.

source: འདོད་པའི་དགའ་བ་དང་། རྒྱལ་སྲིད་དང་། ལོངས་སྤྱོད་དང་། དབང་ཕྱུག་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་མི་བྱ་བ་དང་།
en: They will never dedicate it toward attaining the gratification of desire, political gain, wealth, or power.

source: བདག་ཉིད་བསོད་ནམས་དང་ལྡན་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་མི་བྱ་བ་དང་།
en: They will never dedicate it so that they themselves may acquire merit.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་འཐོབ་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་མི་བྱ་བའོ། །
en: They will never dedicate it in order to attain the state of a śrāvaka or a solitary buddha.

source: དེས་སྦྱིན་པ་སྦྱིན་པ་ན་སྦྱིན་པ་དེ་ཡན་ལག་བཞི་ཡོངས་སུ་དག་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱ་སྟེ།
en: “When they practice generosity, they dedicate the act of giving toward perfecting four types of purification.

source: དེ་ལ་ཡན་ལག་བཞི་ཡོངས་སུ་དག་པ་ཡོངས་སུ་རྫོགས་པ་གང་ཞེ་ན།
en: What are these four types of purification to be perfected?

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱ་བ་དང་།
en: They dedicate their generosity toward the purification of the buddhafields.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱ་བ་དང་།
en: They dedicate it to the purification of the community of bodhisattvas.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱ་བ་དང་།
en: They dedicate it toward bringing all beings to maturity.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་བསྔོ་བར་བྱ་བ་སྟེ།
en: They dedicate it toward purifying omniscient wisdom.

source: དེ་ལྟར་ན་ཡན་ལག་བཞི་ཡོངས་སུ་དག་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་དེ་ཡོངས་སུ་བསྔོ་བར་བྱའོ། །
en: That is how bodhisattva great beings dedicate their generosity toward the perfection of four types of purification.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་ཉེ་བར་བརྟན་པར་བྱའི་ཟད་པར་མི་བྱའོ། །
en: “Furthermore, son of noble family, bodhisattva great beings stabilize their generosity and do not let it become exhausted.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱིན་པ་ཇི་ལྟར་ཟད་པར་འགྱུར་ཞེ་ན།
en: How might the bodhisattvas’ generosity become exhausted, you ask?

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་པ་རྣམས་ཀྱི་སྦྱིན་པ་ནི་ཟད་པར་འགྱུར་ཏེ།
en: Son of noble family, the generosity of bodhisattvas will become exhausted if it is associated with four traits.

source: ཡོངས་སུ་མ་བསྔོས་པ་དང་། ཐབས་མི་མཁས་པ་དང་། དམའ་བར་སྐྱེ་བར་འདོད་པ་དང་། སྡིག་པའི་གྲོགས་པོ་ལ་བསྟེན་པ་སྟེ་
en: Not dedicating; lacking skill in method; aiming for lower rebirths; and associating with negative companions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པ་རྣམས་ཀྱི་སྦྱིན་པ་ནི་ཟད་པར་འགྱུར་རོ། །
en: Son of noble family, the generosity of bodhisattvas will become exhausted if it is associated with these four traits.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་དང་ལྡན་པ་རྣམས་ཀྱི་སྦྱིན་པ་ནི་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་ལ་ཉེ་བར་བརྟན་པར་འགྱུར་རོ། །
en: “On the other hand, son of noble family, if the generosity of bodhisattva great beings is associated with four other traits, it will be stabilized and not become exhausted.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་དང་།
en: To fully dedicate the act toward unsurpassed and completely perfect awakening;

source: ཐབས་ལ་མཁས་པ་དང་།
en: to be skilled in method;

source: ཆོས་ཀྱི་རྒྱལ་སྲིད་འདོད་པ་དང་།
en: to strive for spiritual dominion;

source: དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པ་སྟེ།
en: and to follow a spiritual guide.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་པ་རྣམས་ཀྱི་སྦྱིན་པ་ནི་ཡོངས་སུ་ཟད་པར་མི་འགྱུར་ལ་ཉེ་བར་བརྟན་པར་འགྱུར་རོ། །
en: Son of noble family, the generosity of bodhisattva great beings will be stabilized and not become exhausted if it is associated with these four traits.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་བཞི་མངོན་དུ་བྱས་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: “Moreover, son of noble family, bodhisattva great beings practice generosity while actualizing four things.

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་དང་།
en: Not to give up the mind of awakening;

source: སེམས་ཅན་ལ་སྙིང་བརྩེ་བ་དང་།
en: to be loving to beings;

source: དེ་བཞིན་གཤེགས་པའི་བཀའ་དང་མི་འགལ་བ་དང་།
en: not to go against the word of the thus-gone ones; and

source: ཆོས་དང་ཟང་ཟིང་གི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པ་ལའང་མི་རེ་བ་སྟེ།
en: not to hope for a reward from the ripening of one’s spiritual or material generosity.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་བཞི་པོ་དེ་དག་མངོན་དུ་བྱས་ལ་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །
en: Son of noble family, bodhisattva great beings should practice generosity while actualizing these four things.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་རྣམས་ཆོས་གསུམ་ལ་དགོད་པའི་ཕྱིར་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: “Furthermore, son of noble family, bodhisattva great beings should practice generosity to establish beings in three things.

source: སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་ལ་དགོད་པ་དང་།
en: To establish all beings in awakening;

source: ཆོས་བསྟན་པ་དེ་ཉིད་ལ་དགོད་པ་དང་།
en: to establish them in the Dharma teachings; and

source: སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པའི་བདེ་བ་ལ་དགོད་པའི་ཕྱིར་ཏེ།
en: to establish all beings in unsurpassed happiness.

source: རིགས་ཀྱི་བུ་ཆོས་གསུམ་པོ་དེ་དག་ལ་སེམས་ཅན་རྣམས་དགོད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །
en: Son of noble family, bodhisattva great beings should practice generosity to establish beings in these three things.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་གཉིས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: “In addition, son of noble family, bodhisattva great beings should practice generosity in pursuit of two things.

source: ལོངས་སྤྱོད་ཆེན་པོ་དང་། གཏོང་བའི་སེམས་ཏེ།
en: Great prosperity and a generous attitude.

source: ཆོས་དེ་གཉིས་འདོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །
en: Bodhisattva great beings should practice generosity in pursuit of these two things.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་གཉིས་ཡོངས་སུ་སྤང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: “Moreover, son of noble family, bodhisattva great beings should practice generosity to abandon two things.

source: ཆགས་པ་དང་། སེར་སྣ་སྟེ།
en: Attachment and stinginess.

source: རིགས་ཀྱི་བུ་ཆོས་དེ་གཉིས་ཡོངས་སུ་སྤང་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །
en: Son of noble family, bodhisattva great beings should practice generosity to abandon these two things.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་གཉིས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: “Furthermore, son of noble family, bodhisattva great beings should practice generosity in order to perfect two things.

source: ཤེས་རབ་དང་ཡེ་ཤེས་ཏེ།
en: Insight and wisdom.

source: རིགས་ཀྱི་བུ་ཆོས་འདི་གཉིས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །
en: Son of noble family, in order to perfect these two things should bodhisattva great beings practice generosity.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་གཉིས་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱ་སྟེ།
en: “Moreover, son of noble family, bodhisattva great beings should practice generosity in order to attain two things.

source: ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་སྟེ།
en: Knowledge of extinction, and knowledge of nonarising.

source: རིགས་ཀྱི་བུ་ཆོས་འདི་གཉིས་ཐོབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་སྦྱིན་པར་བྱའོ། །
en: Son of noble family, in order to attain these two things should bodhisattvas practice generosity.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔས་གང་དག་སྦྱིན་པར་བྱ་བའི་སྦྱིན་པ་དག་ནི་རྣམ་པ་བཞི་སྟེ།
en: “In addition, son of noble family, any act of generosity carried out by a bodhisattva may be of four kinds.

source: སེམས་སྙོམས་པའི་སྦྱིན་པ་དང་།
en: Generosity with an impartial attitude;

source: རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའི་སྦྱིན་པ་དང་།
en: generosity without expecting reward in the form of ripening;

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་སྦྱིན་པ་དང་།
en: generosity dedicated to awakening; and

source: དུལ་བ་དང་། ཞི་བ་དང་། ཉེ་བར་ཞི་བ་ཡོངས་སུ་རྫོགས་པའི་སྦྱིན་པ་སྟེ།
en: generosity that perfects gentleness, calmness, and tranquility.

source: རིགས་ཀྱི་བུ་སྦྱིན་པ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པར་བྱ་བ་དག་གོ། །
en: Son of noble family, these four ways of giving constitute the bodhisattva great beings’ ways of generosity.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་མི་བཟད་པ་མངོན་པར་འབྱུང་བར་འདོད་པས་སྦྱིན་པའི་ཚོགས་འདི་ལྟ་བུ་ལ་བརྩོན་པར་བྱའོ། །
en: “Therefore, son of noble family, a bodhisattva who wishes to manifest inexhaustible merit should endeavor in these sorts of accumulations of generosity.”

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བའི་སླད་དུ་སྦྱིན་པའི་ཚོགས་འདི་བཀའ་སྩལ་པ་ངོ་མཚར་ལགས་སོ། །
en: “Blessed One, the way the Thus-Gone One has expounded on the accumulation of generosity so that others can apprehend all buddhadharmas is truly marvelous.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྦྱིན་པའི་ཚོགས་འདི་ལྟ་བུ་དང་ལྡན་པ་དེ་དག་ནི་ནམས་ཀྱང་བསོད་ནམས་ཡོངས་སུ་ཉམས་པའམ། ཡེ་ཤེས་ཡོངས་སུ་ཉམས་པའམ། ཤེས་རབ་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་ལགས་སོ། །
en: Blessed One, those bodhisattva great beings who possess such an accumulation of generosity as this will not diminish in merit, will not diminish in wisdom, nor will they diminish in insight.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རི
en: The Blessed One replied,

source: གས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །
en: “Indeed, son of noble family.

source: ཁྱོད་ཇི་སྐད་ཟེར་བ་བཞིན་ཏེ།
en: It is just as you have said.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་སྦྱིན་པའི་ཚོགས་འདི་ལྟ་བུ་དང་ལྡན་པ་དེ་དག་ནི་བསོད་ནམས་མི་ཟད་པ་དང་། བསོད་ནམས་རྒྱ་མཚོས་མངོན་པར་འབྱུང་བར་འགྱུར་རོ། །
en: Those bodhisattva great beings who possess such an accumulation of generosity as this manifest inexhaustible and ocean-like merit.

source: དེ་དག་ནི་འཕགས་པའི་ཆོས་དང་ལྡན་པས་དབུལ་པོར་ཡང་མི་འགྱུར་རོ། །
en: Since they possess noble qualities, they will not fall destitute.

source: དེ་དག་ནི་ཆོས་ཀྱི་རྒྱུན་དང་ལྡན་པས་ལོངས་སྤྱོད་ཆེན་པོར་ཡང་འགྱུར་རོ། །
en: Since they possess the lineage of Dharma, they will also be prosperous.

source: དེ་དག་ནི་ནོར་བདུན་དང་ལྡན་པས་ཕྱུག་པོར་ཡང་འགྱུར་རོ། །
en: Since they possess the seven riches, they will also be wealthy.

source: དེ་དག་ནི་བསོད་ནམས་བརྒྱའི་མཚན་ཡོད་པས་བསོད་ནམས་ཆེན་པོ་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: Since they have the marks of one hundred merits, they possess great merit as well.

source: དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བས་བསོད་ནམས་ཀྱི་ཞིང་ཡང་ཡིན་ནོ། །
en: Since they nurture all beings, they are also a field of merit.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚན་པོ་ཆེ་ཆེན་པོ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་ལ་གཞན་ཡང་བཀའ་སྩལ་པ།
en: The Blessed One then continued to address the mighty strongman Vimalatejā,

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་གང་ཞེ་ན།
en: “Son of noble family, what is the bodhisattvas’ accumulation of discipline, you ask?

source: གང་ཚུལ་ཁྲིམས་མ་ཉམས་པ་དང་། བསླབ་པ་ཡོངས་སུ་མི་གཏོང་བ་དང་།
en: It is not to let discipline deteriorate and not to give up the training.

source: ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་སྙིང་རྗེ་བ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་རྣམས་ལ་གུས་པ་དྲག་པོ་དང་ལྡན་པ་དང་།
en: It is to have compassion for those with faulty discipline, and sincere respect for those who are disciplined.

source: ལུས་ཀྱི་ཡན་ལག་གསུམ་ཡོངས་སུ་དག་པ་དང་། ངག་གི་ཡན་ལག་བཞི་ཡོངས་སུ་དག་པ་དང་། ཡིད་ཀྱི་ཡན་ལག་གསུམ་ཡོངས་སུ་དག་པ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླང་བ་རྗེས་སུ་སྒྲུབ་པ་སྟེ། གཞན་དག་ཀྱང་དེ་ལ་འཛུད་པ་དང་། དེ་དག་ལ་འགོད་པར་བྱེད་པ་དང་།
en: It is to carry out and follow the path of the ten virtuous deeds correctly—with purity in regard to the three physical disciplines, with purity in regard to the four verbal disciplines, and with purity in regard to the three mental disciplines—as well as leading others to this path and establishing others in it.

source: བདག་ལ་མི་སྟོད་པ་དང་། གཞན་དག་ལ་མི་སྨོད་པ་དང་།
en: “It is not to praise oneself; not to belittle others;

source: ཚུལ་ཁྲིམས་དག་ལ་དེའི་ངང་ཅན་དུ་གྱུར་པ་དང་། ཚུལ་ཁྲིམས་ཀྱིས་མི་རློམ་པ་དང་།
en: to embody the various types of discipline; not to be conceited about one’s discipline;

source: བརྩོན་པ་མི་འདོར་བ་དང་།
en: not to lose one’s endeavor;

source: སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པ་དག་ལས་མི་གཡོ་བ་དང་།
en: not to stray from the qualities of an ascetic or from having few possessions;

source: འཕགས་པའི་རིགས་གནས་པར་བྱེད་པ་དང་།
en: to preserve the lineage of the noble ones;

source: རང་གི་སེམས་སྲུང་བ་དང་།
en: to guard one’s mind;

source: གཞན་གྱི་འཁྲུལ་པ་དག་ལ་སྐྱོན་དུ་མི་ལྟ་བ་དང་།
en: not to find fault in others’ confusion;

source: སྡིག་པ་ཐམས་ཅད་མི་བྱེད་པ་དང་།
en: not to do anything negative;

source: སྲིད་པ་མངོན་པར་འགྲུབ་པ་ལ་མངོན་པར་མི་དགའ་བ་དང་།
en: to feel aversion for the unfolding of existence;

source: གཞན་རྣམས་དགེ་བའི་རྩ་བ་དག་ལ་འཛུད་པ་དང་།
en: to lead others into the roots of virtue;

source: གཞན་གྱི་བྱ་བདག་ལ་སྤྲོ་བ་དང་།
en: to rejoice in others’ deeds;

source: བདེ་བ་དག་ལ་དེའི་ངང་ཅན་དུ་མི་འགྱུར་བ་དང་།
en: not to have the character of a pleasure-seeker;

source: དགོན་པར་གནས་པ་མི་འདོར་བ་དང་།
en: not to abandon life in solitude;

source: ནད་པ་རྣམས་ཀྱི་གཡོག་བྱེད་པ་དང་། བྱས་ནས་ཀྱང་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བར་འགྱུར་བ་དང་།
en: to assist those who are unwell and be pleased and joyous to do so;

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་དང་།
en: to follow one’s words with actions;
